#Задание 2
#Написать функцию которая будет простое число возводить в квардрат.



list1 = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101]
def square(num):
    return num ** 2
squared_list1 = list(map(square, list1))

print(squared_list1)

#Необходимо возвести в квадрат все простые числа в списке используя функцию map

list1 = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101]
list1 = map(square, list1)
print (list(list1))




